RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/CMSIS/GD/GD32F5xx/Source/IAR/startup_gd32f5xx.s
        PUBWEAK DMA1_Channel7_IRQHandler          
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel7_IRQHandler          
        B DMA1_Channel7_IRQHandler          

        PUBWEAK USART5_IRQHandler                 
        SECTION .text:CODE:NOROOT:REORDER(1)
USART5_IRQHandler                 
        B USART5_IRQHandler                 

        PUBWEAK I2C2_EV_IRQHandler               
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_EV_IRQHandler               
        B I2C2_EV_IRQHandler               

        PUBWEAK I2C2_ER_IRQHandler                
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_ER_IRQHandler                
        B I2C2_ER_IRQHandler                

        PUBWEAK USBHS_EP1_Out_IRQHandler    
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS_EP1_Out_IRQHandler    
        B USBHS_EP1_Out_IRQHandler    

        PUBWEAK USBHS_EP1_In_IRQHandler     
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS_EP1_In_IRQHandler     
        B USBHS_EP1_In_IRQHandler     

        PUBWEAK USBHS_WKUP_IRQHandler             
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS_WKUP_IRQHandler             
        B USBHS_WKUP_IRQHandler             

        PUBWEAK USBHS_IRQHandler                  
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS_IRQHandler                  
        B USBHS_IRQHandler                  

        PUBWEAK DCI_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
DCI_IRQHandler                    
        B DCI_IRQHandler                    

        PUBWEAK TRNG_IRQHandler                  
        SECTION .text:CODE:NOROOT:REORDER(1)
TRNG_IRQHandler                  
        B TRNG_IRQHandler                  

        PUBWEAK FPU_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
FPU_IRQHandler                    
        B FPU_IRQHandler                    

        PUBWEAK UART6_IRQHandler                  
        SECTION .text:CODE:NOROOT:REORDER(1)
UART6_IRQHandler                  
        B UART6_IRQHandler                  

        PUBWEAK UART7_IRQHandler                  
        SECTION .text:CODE:NOROOT:REORDER(1)
UART7_IRQHandler                  
        B UART7_IRQHandler                  

        PUBWEAK SPI3_IRQHandler                   
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI3_IRQHandler                   
        B SPI3_IRQHandler                   

        PUBWEAK SPI4_IRQHandler                   
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI4_IRQHandler                   
        B SPI4_IRQHandler                   

        PUBWEAK SPI5_IRQHandler                   
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI5_IRQHandler                   
        B SPI5_IRQHandler                   

        PUBWEAK SAI_IRQHandler                   
        SECTION .text:CODE:NOROOT:REORDER(1)
SAI_IRQHandler                   
        B SAI_IRQHandler   

        PUBWEAK TLI_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
TLI_IRQHandler                    
        B TLI_IRQHandler                    

        PUBWEAK TLI_ER_IRQHandler                 
        SECTION .text:CODE:NOROOT:REORDER(1)
TLI_ER_IRQHandler                 
        B TLI_ER_IRQHandler                 

        PUBWEAK IPA_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
IPA_IRQHandler                    
        B IPA_IRQHandler                    

        PUBWEAK PKCAU_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
PKCAU_IRQHandler                    
        B PKCAU_IRQHandler                    

        PUBWEAK I2C3_EV_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_EV_IRQHandler                    
        B I2C3_EV_IRQHandler                    

        PUBWEAK I2C3_ER_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_ER_IRQHandler                    
        B I2C3_ER_IRQHandler                    

        PUBWEAK I2C4_EV_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C4_EV_IRQHandler                    
        B I2C4_EV_IRQHandler                    

        PUBWEAK I2C4_ER_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C4_ER_IRQHandler                    
        B I2C4_ER_IRQHandler                    

        PUBWEAK I2C5_EV_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C5_EV_IRQHandler                    
        B I2C5_EV_IRQHandler                    

        PUBWEAK I2C5_ER_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C5_ER_IRQHandler                    
        B I2C5_ER_IRQHandler                    

        PUBWEAK I2C3_WKUP_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_WKUP_IRQHandler                    
        B I2C3_WKUP_IRQHandler                    

        PUBWEAK I2C4_WKUP_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C4_WKUP_IRQHandler                    
        B I2C4_WKUP_IRQHandler                    

        PUBWEAK I2C5_WKUP_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C5_WKUP_IRQHandler                    
        B I2C5_WKUP_IRQHandler                    

        PUBWEAK SYSCFG_SINGLE_BIT_ECC_ER_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
SYSCFG_SINGLE_BIT_ECC_ER_IRQHandler                    
        B SYSCFG_SINGLE_BIT_ECC_ER_IRQHandler                    

        PUBWEAK HAU_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
HAU_IRQHandler                    
        B HAU_IRQHandler                    

        PUBWEAK CAU_IRQHandler                    
        SECTION .text:CODE:NOROOT:REORDER(1)
CAU_IRQHandler                    
        B CAU_IRQHandler                    

        END